import colorama
GREEN = colorama.Fore.GREEN
CYAN = colorama.Fore.CYAN
YELLOW = colorama.Fore.YELLOW
RED = colorama.Fore.RED
UPPER = colorama.Style.BRIGHT
BLUE = colorama.Fore.BLUE

while True:
    choice = input("Оберіть сезон (1,2,3) ")
    if choice == "1":
        print("Ти вже повинен був пройти його!")
    elif choice == "2":
        while True:
            question2 = input("Ти хочешь послухати свою передісторію? (Так чи ні)" )
            if question2 == "Так" or question2 == "так":
                    print(f"{UPPER}Ти п'ятнадцяти річний хлопець, зовсім скоро Новий рік, та семестрові. \n \n Ти знову проспав школу, мабуть тому що ти навіть не завів будильник. Але ти вирішив сьогодні не йти у школу, від одного пропущеного дня нічого не станеться : )" \
                    "\n  Наразі твої батьки уїхали у зимню відпуску. Вони хотіли взяти тебе також але ти відмовився, тому наразі ти дома один.")
                    colorama.init(autoreset=True)
                    question3 = input("Тобі потрібно написати класному керівнику що тебе не буде, напишеш ти чи ні? (так або ні) \n \n Твоє рішення: ")
                    if question3 == "так" or question3 == "Так":
                        print("\n Ти вирішив написати класному керівнику зараз. Щоб потім до тебе не було питань. ")
                        print("Що ти напишеш?")
                        question4 = input("\n 1. Доброго ранку, мене сьогодні не буде по поважній причіні. \n \n 2. Мене сьогодні не буде. \n \n 3. Добрий ранок, я буду відсутнім до пятниці. \n Твоя відповідь: ")
                        if question4 == "1" or question4 == "2" or question4 == "3":
                            print("Після того як ти написав повідомленя, тобі стало нудно. Чим тобі зайнятися?")
                            question5 = input(" \n 1. Поснідати \n \n 2. Поспати \n \n Твоя відповідь: ")
                            if question5 == "1":
                                print("\n \n Ти пішов готувати собі сніданок, але твій максимум - Бутерброди та жарені яйца. \n Може спробувати приготувати щось нове? \n \n")
                                question6 = input("Так чи ні?")
                                if question6 == "Так" or question6 == "так":
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    choice1 = input("Ти візмеш трубку? (Так або ні) ")
                                    if choice1 == "Так" or choice1 == "так":
                                        print(f"{GREEN}Ти відповів мамі. Вона радісно привітала тебе та спросила чому ти сьогодні не пішов у школу.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                                        colorama.init(autoreset=True)
                                        print("Ти був дуже вялий та ти хотів спати, тому ти пійшов до себе у кімнату, тільки ліг на кровать та тут же заснув.")
                                elif question6 == "Ні" or question6 == "ні":
                                    print("Ні? такої відповіді не буває. Тому ти відкрив інттернет та почав готувати.")
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    choice1 = input("Ти візмеш трубку? (Так або ні) ")
                                    if choice1 == "ні" or choice1 == "Ні":
                                        print("Ти відклонив визов, але мама не здалася. Ти все ж таки взяв трубку.")
                                        print("\n мама була обурена через те що ти не відповідав їй, вона спитала чого тебе не було у школі.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                            elif question5 == "2":
                                print(f"{BLUE}\n прокинувся ти вже близко к 6 годині вечора. Ти взяв сві телефон та побачив пропущені від мами, тато, класного керівника.\n Ти хотів подзвонити хоча б мамі, але в тебе вимкнули світло та не було зв'язку. ")
                                colorama.init(autoreset=True)
                                print("Ти вздохнув та с білью у голові пішов включити хоч герлянду на кухні та поставити чайник. \n Прийшовши на кухню ти підійшов до герлянди, та включив її ти помітив що вона не світилась, мабуть батарейки розрядилися.")
                                print("Прийдеться шукати інші. Де ти іх будешь шукати?")
                                while True:
                                    choice2 = input("\n 1. На кухні \n 2. У залі \n 3. У кімнатах \n\n Твоя відповідь: ")
                                    if choice2 == "1":
                                        print(f"{RED}\n Ти начав шукати іх на кухні, але не знайшов.")
                                    elif choice2 == "2":
                                        print(f"\n{RED} Ти пішов у залу, але нічого не знайшов окрім грошей, які оставили тобі на неділю.")
                                    elif choice2 == "3":
                                        print(f"{GREEN}\n Ти начав шукати у кімнатах, спочатку у своїй, а потім зайшов до батьківсьої кімнати...Та знайшов робочі батарейки!")
                                        colorama.init(autoreset=True)
                                        print(f"Ти повернувся на кухню, але побачив що {RED}ге{YELLOW}рл{GREEN}ян{BLUE}да {CYAN} стала світити ярче, хоча ти ще не поміняв батарейки..Ну ладно.")
                                        print("Після кіпіння чайника ти почув якийсь грохот зі спальної кімнати.")
                                        choice3 = input("Ти хочеш провірити кімнату? ")
                                        if choice3 == "так" or choice3 == "Так":
                                            print("\n \n Ти вирішив на всяк випадок провіріти кімнати. \n Спочатку ти пішов до своєї кімнати, ти побачив лише відкрите вікно, закрив вікно ти подумав шо такий шум стался через сильний вітер.")
                                            print("тому повернувся на кухню щоб доробити собі чай, біля чашки с кіпятком ти побачив невеликий листок на якому було написано: 4 сз. 452287")
                                            print("Такого вже точно не було на кухні, тебе це насторожило. Але щоб себе заспокоїти ти сказав собі 'я просто не помітив цього' ")
                                            print("\n \n через час ти вже и забув про шум у кімнати та просто грав у ігри на телефоні, але раптом хтось начав дуже активно стучати у двері \n Ти трохи здивувався бо не очікував гостей або ще когось. Підійшовши до двери ти спросив 'Хто там?' але відповіді ти не почув.")
                                            choice4 = input("Може треба відчинити дверь та поглянути хто там? (так або ні) \n\n Твоя відповідь: ")
                                            if choice4 == "Так" or choice4 == "так":
                                                print(f"{UPPER} Не думала, що ти настільки дурний..{RED} Відкривши двері на тебе накинулась людина у костюмі Санта клауса та почала душити тебе. \n\n               ПОГАНА КІНЦІВКА. \n      дураку біло б ясно що не треба відчіняти двері.")
                                                break
                                            
                                        elif choice3 == "ні" or choice3 == "Ні":
                                            print(f"{UPPER} Ти проігнорував звук,{RED} зря..Ти почув як хтось наче вибив двері з кухні, від дуже сильного шуму та трусу ти повернувся та побачив його...")
                                            print(f"{UPPER}{RED}           ПОГАНА КІНЦІВКА. \n    Треба буду впевненим завжди. ")
                                            colorama.init(autoreset=True)
                                            break
                                            
                                        if choice4 == "ні" or choice4 == "Ні":
                                                print("Молодец, але стук не припинявся.. Що ти робитемеш?")
                                                choi4ce5 = input(" \n 1. Спрячусь \n \n 2. Все ж таки відкрию двері \n \n 3. Хай далі стучить \n Твоя відповідь: ")
                                                if choi4ce5 == "1":
                                                    print("\n \n Ну... добре. Ти закрився у себе в кімнаті та просто сів на кровать.\n Ти начав чути як хтось наче вибив двері та інші дуже гучні звуки. До тебе також дійшла черга.")
                                                    print(f"{UPPER} Він вибив двері та побачив тебе...")
                                                    print(f"{RED}           ПОГАНА КІНЦІВКА.")
                                                    print("           мабуть схованки це не твоє.")
                                                    colorama.init(autoreset=True)
                                                    break
                                                elif choi4ce5 == "2":
                                                    print(f"{UPPER} Не думала, що ти настільки дурний..{RED} Відкривши двері ти побачив людину у костюмі Санта, який забрав тебе з собою. \n\n               ПОГАНА КІНЦІВКА. \n      Ти забув що тобі мама казала?")
                                                    colorama.init(autoreset=True)
                                                    break
                                                elif choi4ce5 == "3":
                                                    print(f"{UPPER}Хай там далі і стучіть. Ти пішов знову до зали та через 5 хвилин ти почув {RED}як хтось вибив дверь...")
                                                    print("\n\n           ПОГАНА КІНЦІВКА. \n      Я очікувала більшого від тебе.")
                                        elif choice3 == "ні" or choice3 == "Ні":
                                            print(f"{UPPER} Ти проігнорував звук,{RED} зря..Ти почув як хтось наче вибив двері з кухні, від дуже сильного шуму та трусу ти повернувся та побачив його...")
                                            print(f"{UPPER}{RED}           ПОГАНА КІНЦІВКА. \n    Треба буду впевненим завжди. ")
                                            colorama.init(autoreset=True)
                                            break
                    elif question3 == "Ні" or question3 == "ні":
                        print(f"{RED} Що значіть ні? Звичайно ти напишеш класному керівнику!")
                        colorama.init(autoreset=True)
                        print("Що ти напишеш?")
                        que4stion4 = input("\n 1. Доброго ранку, мене сьогодні не буде по поважній причіні. \n \n 2. Мене сьогодні не буде. \n \n 3. Добрий ранок, я буду відсутнім до пятниці. \n Твоя відповідь: ")
                        if que4stion4 == "1" or que4stion4 == "2" or que4stion4 == "3":
                            print("Після того як ти написав повідомленя, тобі стало нудно. Чим тобі зайнятися?")
                            que5stion5 = input(" \n 1. Поснідати \n \n 2. Поспати \n \n Твоя відповідь: ")
                            if que5stion5 == "1":
                                print("\n \n Ти пішов готувати собі сніданок, але твій максимум - Бутерброди та жарені яйца. \n Може спробувати приготувати щось нове? \n \n")
                                que6stion6 = input("Так чи ні? ")
                                if que6stion6 == "Так" or que6stion6 == "так":
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    cho1ice1 = input("Ти візмеш трубку? (Так або ні) ")
                                    if cho1ice1 == "Так" or cho1ice1 == "так":
                                        print(f"{GREEN}Ти відповів мамі. Вона радісно привітала тебе та спросила чому ти сьогодні не пішов у школу.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                                        colorama.init(autoreset=True)
                                elif que6stion6 == "Ні" or que6stion6 == "ні":
                                    print(f"{RED} Ні? такої відповіді не буває. Тому ти відкрив інттернет та почав готувати.")
                                    colorama.init(autoreset=True)
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    cho1ice1 = input("Ти візмеш трубку? (Так або ні) ")
                                    if cho1ice1 == "Ні" or cho1ice1 == "ні":
                                        print("Ти відклонив визов, але мама не здалася. Ти все ж таки взяв трубку.")
                                        print("\n мама була обурена через те що ти не відповідав їй, вона спитала чого тебе не було у школі.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                            elif que5stion5 == "2":
                                print(f"{BLUE}Ти вирішив поспати, кинувшись на своє ліжко ти швидко заснув. \n прокинувся ти вже близко к 6 годині вечора. Ти взяв сві телефон та побачив пропущені від мами, тато, класного керівника.\n Ти хотів подзвонити хоча б мамі, але в тебе вимкнули світло та не було зв'язку. ")
                                colorama.init(autoreset=True)
                                print("Ти вздохнув та с білью у голові пішов включити хоч герлянду на кухні та поставити чайник. \n Прийшовши на кухню ти підійшов до герлянди, та включив її ти помітив що вона не світилась, мабуть батарейки розрядилися.")
                                print("Прийдеться шукати інші. Де ти іх будешь шукати?")
                                while True:
                                    cho2ice2 = input("\n 1. На кухні \n 2. У залі \n 3. У кімнатах \n\n Твоя відповідь: ")
                                    if cho2ice2 == "1":
                                        print(f"\n{RED} Ти начав шукати іх на кухні, але не знайшов.")
                                    elif cho2ice2 == "2":
                                        print(f"\n{RED} Ти пішов у залу, але нічого не знайшов окрім грошей, які оставили тобі на неділю.")
                                    elif cho2ice2 == "3":
                                        print(f"\n{GREEN} Ти начав шукати у кімнатах, спочатку у своїй, а потім зайшов до батьківсьої кімнати...Та знайшов робочі батарейки!")
                                        colorama.init(autoreset=True)
                                        print("Ти повернувся на кухню, але побачив що герлянда стала світити ярче, хоча ти ще не поміняв батарейки..Ну ладно.")
                                        print("Після кіпіння чайника ти почув якийсь грохот зі спальної кімнати.")
                                        cho3ice3 = input("Ти хочеш провірити кімнату? ")
                                        if cho3ice3 == "так" or cho3ice3 == "Так":
                                            print("\n \n Ти вирішив на всяк випадок провіріти кімнати. \n Спочатку ти пішов до своєї кімнати, ти побачив лише відкрите вікно, закрив вікно ти подумав шо такий шум стался через сильний вітер.")
                                            print("тому повернувся на кухню щоб доробити собі чай, біля чашки с кіпятком ти побачив невеликий листок на якому було написано: 4 сз. 452287")
                                            print("Такого вже точно не було на кухні, тебе це насторожило. Але щоб себе заспокоїти ти сказав собі 'я просто не помітив цього' ")
                                            print("\n \n через час ти вже и забув про шум у кімнати та просто грав у ігри на телефоні, але раптом хтось начав дуже активно стучати у двері \n Ти трохи здивувався бо не очікував гостей або ще когось. Підійшовши до двери ти спросив 'Хто там?' але відповіді ти не почув.")
                                            cho4ice4 = input("Може треба відчинити дверь та поглянути хто там? (так або ні) \n\n Твоя відповідь: ")
                                            if cho4ice4 == "Так" or cho4ice4 == "так":
                                                print(f"\n \n {UPPER} Не думала, що ти настільки дурний..{RED} Відкривши двері на тебе накинулась людина у костюмі Санта клауса та почала душити тебе. \n\n               ПОГАНА КІНЦІВКА. \n      дураку біло б ясно що не треба відчіняти двері.")
                                                break
                                        elif cho3ice3 == "ні" or cho3ice3 == "Ні":
                                            print(f"\n \n {UPPER} Ти проігнорував звук,{RED} зря..Ти почув як хтось наче вибив двері з кухні, від дуже сильного шуму та трусу ти повернувся та побачив його...")
                                            print(f"\n {UPPER}{RED}           ПОГАНА КІНЦІВКА. \n    Треба бути впевненим завжди. ")
                                            break                           
            elif question2 == "Ні" or question2 == "ні":
                print("Серьозно? ну як хочешь. Що тоді ти будеш робити?")
            while True:
                questi3on3 = input("Тобі потрібно написати класному керівнику що тебе не буде, напишеш ти чи ні? (так або ні) \n \n Твоє рішення: ")
                if questi3on3 == "так" or questi3on3 == "Так":
                    print("\n Ти вирішив написати класному керівнику зараз. Щоб потім до тебе не було питань. ")
                    print("Що ти напишеш?")
                    questi4on4 = input("\n 1. Доброго ранку, мене сьогодні не буде по поважній причіні. \n \n 2. Мене сьогодні не буде. \n \n 3. Добрий ранок, я буду відсутнім до пятниці. \n Твоя відповідь: ")
                    if questi4on4 == "1" or questi4on4 == "2" or questi4on4 == "3":
                        print("Після того як ти написав повідомленя, тобі стало нудно. Чим тобі зайнятися?")
                        questi5on5 = input(" \n 1. Поснідати \n \n 2. Поспати \n \n Твоя відповідь: ")
                        if questi5on5 == "1":
                            print("\n \n Ти пішов готувати собі сніданок, але твій максимум - Бутерброди та жарені яйца. \n Може спробувати приготувати щось нове? \n \n")
                            questi6on6 = input("Так чи ні?")
                            if questi6on6 == "Так" or questi6on6 == "так":
                                print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                choi1ce1 = input("Ти візмеш трубку? (Так або ні) ")
                                if choi1ce1 == "Так" or choi1ce1 == "так":
                                    print(f"{GREEN}Ти відповів мамі. Вона радісно привітала тебе та спросила чому ти сьогодні не пішов у школу.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                                    colorama.init(autoreset=True)
                                    print("Ти був дуже вялий та ти хотів спати, тому ти пійшов до себе у кімнату, тільки ліг на кровать та тут же заснув.")
                            elif questi6on6 == "Ні" or questi6on6 == "ні":
                                    print("Ні? такої відповіді не буває. Тому ти відкрив інттернет та почав готувати.")
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    choice1 = input("Ти візмеш трубку? (Так або ні) ")
                                    if choice1 == "ні" or choice1 == "Ні":
                                        print("Ти відклонив визов, але мама не здалася. Ти все ж таки взяв трубку.")
                                        print("\n мама була обурена через те що ти не відповідав їй, вона спитала чого тебе не було у школі.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                        elif questi5on5 == "2":
                            print(f"{BLUE}\n прокинувся ти вже близко к 6 годині вечора. Ти взяв сві телефон та побачив пропущені від мами, тато, класного керівника.\n Ти хотів подзвонити хоча б мамі, але в тебе вимкнули світло та не було зв'язку. ")
                            colorama.init(autoreset=True)
                            print("Ти вздохнув та с білью у голові пішов включити хоч герлянду на кухні та поставити чайник. \n Прийшовши на кухню ти підійшов до герлянди, та включив її ти помітив що вона не світилась, мабуть батарейки розрядилися.")
                            print("Прийдеться шукати інші. Де ти іх будешь шукати?")
                            while True:
                                choi2ce2 = input("\n 1. На кухні \n 2. У залі \n 3. У кімнатах \n\n Твоя відповідь: ")
                                if choi2ce2 == "1":
                                    print("\n Ти начав шукати іх на кухні, але не знайшов.")
                                elif choi2ce2 == "2":
                                        print("\n Ти пішов у залу, але нічого не знайшов окрім грошей, які оставили тобі на неділю.")
                                elif choi2ce2 == "3":
                                    print("\n Ти начав шукати у кімнатах, спочатку у своїй, а потім зайшов до батьківсьої кімнати...Та знайшов робочі батарейки!")
                                    print(f"Ти повернувся на кухню, але побачив що {RED}ге{YELLOW}рл{GREEN}ян{BLUE}да{CYAN} стала світити ярче, хоча ти ще не поміняв батарейки..Ну ладно.")
                                    print("Після кіпіння чайника ти почув якийсь грохот зі спальної кімнати.")
                                    choi3ce3 = input("Ти хочеш провірити кімнату? ")
                                    if choi3ce3 == "так" or choi3ce3 == "Так":
                                        print("\n \n Ти вирішив на всяк випадок провіріти кімнати. \n Спочатку ти пішов до своєї кімнати, ти побачив лише відкрите вікно, закрив вікно ти подумав шо такий шум стался через сильний вітер.")
                                        print("тому повернувся на кухню щоб доробити собі чай, біля чашки с кіпятком ти побачив невеликий листок на якому було написано: 4 сз. 452287")
                                        print("Такого вже точно не було на кухні, тебе це насторожило. Але щоб себе заспокоїти ти сказав собі 'я просто не помітив цього' ")
                                        print("\n \n через час ти вже и забув про шум у кімнати та просто грав у ігри на телефоні, але раптом хтось начав дуже активно стучати у двері \n Ти трохи здивувався бо не очікував гостей або ще когось. Підійшовши до двери ти спросив 'Хто там?' але відповіді ти не почув.")
                                        choi4ce4 = input("Може треба відчинити дверь та поглянути хто там? (так або ні) \n\n Твоя відповідь: ")
                                        if choi4ce4 == "Так" or choi4ce4 == "так":
                                            print(f"{UPPER} Не думала, що ти настільки дурний..{RED} Відкривши двері на тебе накинулась людина у костюмі Санта клауса та почала душити тебе. \n\n               ПОГАНА КІНЦІВКА. \n      дураку біло б ясно що не треба відчіняти двері.")
                                            break
                                    elif choi3ce3 == "ні" or choi3ce3 == "Ні":
                                        print(f"{UPPER} Ти проігнорував звук,{RED} зря..Ти почув як хтось наче вибив двері з кухні, від дуже сильного шуму та трусу ти повернувся та побачив його...")
                                        print(f"{UPPER}{RED}           ПОГАНА КІНЦІВКА. \n    Треба буду впевненим завжди. ")
                                        break
                                    elif choi3ce3 == "ні" or choi3ce3 == "Ні":
                                        print(f"{UPPER} Ти проігнорував звук,{RED} зря..Ти почув як хтось наче вибив двері з кухні, від дуже сильного шуму та трусу ти повернувся та побачив його...")
                                        print(f"{UPPER}{RED}           ПОГАНА КІНЦІВКА. \n     Треба буду впевненим завжди. ")
                                        break
                    elif questi3on3 == "Ні" or questi3on3 == "ні":
                        print(f"{RED} Що значіть ні? Звичайно ти напишеш класному керівнику!")
                        colorama.init(autoreset=True)
                        print("Що ти напишеш?")
                        que4stion = input("\n 1. Доброго ранку, мене сьогодні не буде по поважній причіні. \n \n 2. Мене сьогодні не буде. \n \n 3. Добрий ранок, я буду відсутнім до пятниці. \n Твоя відповідь: ")
                        if que4stion == "1" or que4stion == "2" or que4stion == "3":
                            print("Після того як ти написав повідомленя, тобі стало нудно. Чим тобі зайнятися?")
                            que5stion = input(" \n 1. Поснідати \n \n 2. Поспати \n \n Твоя відповідь: ")
                            if que5stion == "1":
                                print("\n \n Ти пішов готувати собі сніданок, але твій максимум - Бутерброди та жарені яйца. \n Може спробувати приготувати щось нове? \n \n")
                                que6stion = input("Так чи ні? ")
                                if que6stion == "Так" or que6stion == "так":
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    cho1ice = input("Ти візмеш трубку? (Так або ні) ")
                                    if cho1ice == "Так" or cho1ice == "так":
                                        print(f"{GREEN}Ти відповів мамі. Вона радісно привітала тебе та спросила чому ти сьогодні не пішов у школу.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                                        colorama.init(autoreset=True)
                                elif que6stion == "Ні" or que6stion == "ні":
                                    print(f"{RED} Ні? такої відповіді не буває. Тому ти відкрив інттернет та почав готувати.")
                                    colorama.init(autoreset=True)
                                    print("Ти взяв свій телефон та відкрив інтернет. \n Ти знайшов гарний рецепт легкої та швидкої страви. \n \n Після того, як ти приготував та поснідал ти побачив що тобі дзонить мама. \n \n ")
                                    cho1ice = input("Ти візмеш трубку? (Так або ні) ")
                                    if cho1ice == "Ні" or cho1ice == "ні":
                                        print("Ти відклонив визов, але мама не здалася. Ти все ж таки взяв трубку.")
                                        print("\n мама була обурена через те що ти не відповідав їй, вона спитала чого тебе не було у школі.\n Ти їй сказав що прихворів, вона сказала де і від чого лежать ліки та сбросила трубку.")
                            elif que5stion == "2":
                                print(f"{BLUE}Ти вирішив поспати, кинувшись на своє ліжко ти швидко заснув. \n прокинувся ти вже близко к 6 годині вечора. Ти взяв сві телефон та побачив пропущені від мами, тато, класного керівника.\n Ти хотів подзвонити хоча б мамі, але в тебе вимкнули світло та не було зв'язку. ")
                                colorama.init(autoreset=True)
                                print("Ти вздохнув та с білью у голові пішов включити хоч герлянду на кухні та поставити чайник. \n Прийшовши на кухню ти підійшов до герлянди, та включив її ти помітив що вона не світилась, мабуть батарейки розрядилися.")
                                print("Прийдеться шукати інші. Де ти іх будешь шукати?")
                                while True:
                                    cho2ice = input("\n 1. На кухні \n 2. У залі \n 3. У кімнатах \n\n Твоя відповідь: ")
                                    if cho2ice == "1":
                                        print("\n Ти начав шукати іх на кухні, але не знайшов.")
                                    elif cho2ice == "2":
                                        print("\n Ти пішов у залу, але нічого не знайшов окрім грошей, які оставили тобі на неділю.")
                                    elif cho2ice == "3":
                                        print("\n Ти начав шукати у кімнатах, спочатку у своїй, а потім зайшов до батьківсьої кімнати...Та знайшов робочі батарейки!")
                                        print("Ти повернувся на кухню, але побачив що герлянда стала світити ярче, хоча ти ще не поміняв батарейки..Ну ладно.")
                                        print("Після кіпіння чайника ти почув якийсь грохот зі спальної кімнати.")
                                        cho3ice = input("Ти хочеш провірити кімнату? ")
                                        if cho3ice == "так" or cho3ice == "Так":
                                            print("\n \n Ти вирішив на всяк випадок провіріти кімнати. \n Спочатку ти пішов до своєї кімнати, ти побачив лише відкрите вікно, закрив вікно ти подумав шо такий шум стался через сильний вітер.")
                                            print("тому повернувся на кухню щоб доробити собі чай, біля чашки с кіпятком ти побачив невеликий листок на якому було написано: 4 сз. 452287")
                                            print("Такого вже точно не було на кухні, тебе це насторожило. Але щоб себе заспокоїти ти сказав собі 'я просто не помітив цього' ")
                                            print("\n \n через час ти вже и забув про шум у кімнати та просто грав у ігри на телефоні, але раптом хтось начав дуже активно стучати у двері \n Ти трохи здивувався бо не очікував гостей або ще когось. Підійшовши до двери ти спросив 'Хто там?' але відповіді ти не почув.")
                                            cho4ice = input("Може треба відчинити дверь та поглянути хто там? (так або ні) \n\n Твоя відповідь: ")
                                            if cho4ice == "Так" or cho4ice == "так":
                                                print(f"\n \n {UPPER} Не думала, що ти настільки дурний..{RED} Відкривши двері на тебе накинулась людина у костюмі Санта клауса та почала душити тебе. \n\n               ПОГАНА КІНЦІВКА. \n      дураку біло б ясно що не треба відчіняти двері.")
                                                quit()
                                                break
                                            if cho4ice == "ні" or cho4ice == "Ні":
                                                print("Молодец, але стук не припинявся.. Що ти робитемеш?")
                                                cho4ce5 = input(" \n 1. Спрячусь \n \n 2. Все ж таки відкрию двері \n \n 3. Хай далі стучить \n Твоя відповідь: ")
                                                if cho4ce5 == "1":
                                                    print("\n \n Ну... добре. Ти закрився у себе в кімнаті та просто сів на кровать.\n Ти начав чути як хтось наче вибив двері та інші дуже гучні звуки. До тебе також дійшла черга.")
                                                    print(f"{UPPER} Він вибив двері та побачив тебе...")
                                                    print(f"{RED}           ПОГАНА КІНЦІВКА.")
                                                    print("           мабуть схованки це не твоє.")
                                                    colorama.init(autoreset=True)
                                                    break
                                                elif cho4ce5 == "2":
                                                    print(f"{UPPER} Не думала, що ти настільки дурний..{RED} Відкривши двері ти побачив людину у костюмі Санта, який забрав тебе з собою. \n\n               ПОГАНА КІНЦІВКА. \n      Ти забув що тобі мама казала?")
                                                    colorama.init(autoreset=True)
                                                    break
                                                elif cho4ce5 == "3":
                                                    print(f"{UPPER}Хай там далі і стучіть. Ти пішов знову до зали та через 5 хвилин ти почув {RED}як хтось вибив дверь...")
                                                    print("\n\n           ПОГАНА КІНЦІВКА. \n      Я очікувала більшого від тебе.")
                                                    quit()
                                        elif cho3ice == "ні" or cho3ice == "Ні":
                                            print(f"{UPPER} Ти проігнорував звук,{RED} зря..Ти почув як хтось наче вибив двері з кухні, від дуже сильного шуму та трусу ти повернувся та побачив його...")
                                            print(f"{UPPER}{RED}           ПОГАНА КІНЦІВКА. \n     Треба буду впевненим завжди. ")
                                            colorama.init(autoreset=True)
                                            quit()
                                            break
    if choice == "3":
        print("Його ще не існує : )")
    elif choice == "4":
        print("Стоп, ти правда цього хочеш?")
        c1hoice = input("Тоді..Який пароль? Твоя відповідь: ")
        if c1hoice == "452287":
            print(f"{UPPER} Тебе надурили : ) \n Четвертого не має та не буде ")
            colorama.init(autoreset=True)
            break
        while True:
            if c1hoice != "452287":
                print("Ну, спробуй ще раз або пройди гру щоб дізнатися пароль : )")